import matplotlib
import pandas as pd
import matplotlib.pyplot as plt
from matplotlib import matplotlib_fname
from matplotlib.font_manager import FontProperties
import seaborn as sns
import missingno as msno
from pylab import mpl


province_include = {
    'GD': ['广州', '珠海', '深圳', '汕头', '韶关', '佛山', '江门', '湛江', '茂名', '肇庆', '惠州', '梅州', '汕尾', '河源', '阳江', '清远', '东莞',
            '中山', '潮州', '揭阳', '云浮'],
    'ZJ': ['杭州', '宁波', '温州', '嘉兴', '湖州', '绍兴', '金华', '衢州', '舟山', '台州', '丽水'],
    'JS': ['南京', '无锡', '徐州', '常州', '苏州', '南通', '连云港', '淮安', '盐城', '扬州', '镇江', '泰州', '宿迁'],
    'SC': ['成都', '自贡', '攀枝花', '泸州', '德阳', '绵阳', '广元', '遂宁', '内江', '乐山', '南充', '眉山', '宜宾', '广安', '达州', '雅安',
            '巴中', '资阳', '阿坝藏族羌族自治州', '甘孜藏族自治州', '凉山彝族自治州'],
    'HB': ['石家庄', '唐山', '秦皇岛', '邯郸', '邢台', '保定', '张家口', '承德', '沧州', '廊坊', '衡水'],
    'HLJ': ['哈尔滨', '齐齐哈尔', '鹤岗', '双鸭山', '鸡西', '大庆', '伊春', '牡丹江', '佳木斯', '七台河', '黑河', '绥化', '大兴安岭地区'],
    'NM': ['呼和浩特', '包头', '乌海', '赤峰', '通辽', '鄂尔多斯', '呼伦贝尔', '巴彦淖尔', '乌兰察布', '锡林郭勒盟', '兴安盟', '阿拉善盟'],
    'LN': ['沈阳', '大连', '鞍山', '抚顺', '本溪', '丹东', '锦州', '营口', '阜新', '辽阳', '盘锦', '铁岭', '朝阳', '葫芦岛'],
    'JL': ['长春', '吉林', '四平', '辽源', '通化', '白山', '松原', '白城', '吉林市', '延边朝鲜族自治州'],
    'AH': ['合肥', '芜湖', '蚌埠', '淮南', '马鞍山', '淮北', '铜陵', '安庆', '黄山', '滁州', '阜阳', '宿州', '巢湖', '六安', '亳州', '池州', '宣城'],
    'FJ': ['福州', '厦门', '莆田', '三明', '泉州', '漳州', '南平', '龙岩', '宁德'],
    'JX': ['南昌', '景德镇', '萍乡', '九江', '新余', '鹰潭', '赣州', '吉安', '宜春', '抚州', '上饶'],
    'SD': ['济南', '青岛', '淄博', '枣庄', '东营', '烟台', '潍坊', '济宁', '泰安', '威海', '日照', '莱芜', '临沂', '德州', '聊城', '滨州', '菏泽'],
    'HuB': ['武汉', '黄石', '十堰', '荆州', '宜昌', '襄樊', '鄂州', '荆门', '孝感', '黄冈', '咸宁', '随州', '大冶', '丹江口', '洪湖', '石首', '松滋',
            '宜都', '当阳', '枝江', '老河口', '枣阳', '恩施土家族苗族自治州', '襄阳',
            '宜城', '钟祥', '应城', '安陆', '汉川', '麻城', '武穴', '赤壁', '广水', '仙桃', '天门', '潜江', '恩施', '利川'],
    'HNa': ['长沙', '株洲', '湘潭', '衡阳', '邵阳', '岳阳', '常德', '张家界', '益阳', '郴州', '永州', '怀化', '娄底', '湘西土家族苗族自治州'],
    'GX': ['南宁', '柳州', '桂林', '梧州', '北海', '防城港', '钦州', '贵港', '玉林', '百色', '贺州', '河池', '来宾',
            '崇左'],
    'GZ': ['贵阳', '六盘水', '遵义', '安顺', '黔西南布依族苗族自治州', '黔东南苗族侗族自治州', '黔南布依族苗族自治州', '铜仁', '毕节'],
    'YN': ['昆明', '曲靖', '玉溪', '保山', '昭通', '丽江', '普洱', '临沧', '迪庆藏族自治州', '怒江傈僳族自治州', '文山壮族苗族自治州',
            '红河哈尼族彝族自治州', '西双版纳傣族自治州', '楚雄彝族自治州', '大理白族自治州', '德宏傣族景颇族自治州'],
    'SX': ['西安', '铜川', '宝鸡', '咸阳', '渭南', '延安', '汉中', '榆林', '安康', '商洛'],
    'GS': ['兰州', '金昌', '白银', '天水市', '嘉峪关', '武威', '张掖', '平凉', '酒泉', '庆阳', '定西', '陇南', '临夏回族自治州', '甘南藏族自治州', '天水'],
    'QH': ['西宁', '海东', '海北藏族自治州', '黄南藏族自治州', '海南藏族自治州', '果洛藏族自治州', '玉树藏族自治州', '海西蒙古族藏族自治州', '德令哈', '格尔木'],
    'HaN': ['海口', '三亚', '文昌', '琼海', '万宁', '五指山', '东方', '儋州', '屯昌县', '保亭黎族苗族自治县', '临高县', '白沙黎族自治县', '定安县',
            '昌江黎族自治县', '乐东黎族自治县', '琼中黎族苗族自治县', '陵水黎族自治县', '澄迈县'],
    'HN': ['郑州', '开封', '洛阳', '平顶山', '安阳', '鹤壁', '新乡', '焦作', '濮阳', '许昌', '漯河', '三门峡', '南阳', '商丘', '信阳', '周口', '驻马店',
            '济源', '鹤壁'],
    'SXb': ['太原', '大同', '朔州', '忻州', '阳泉', '吕梁', '晋中', '长治', '晋城', '临汾', '运城'],
    'TW': ['台北市', '高雄', '基隆', '台中', '台南', '新竹', '嘉义', '新北市'],
    'NX': ['银川', '石嘴山', '吴忠', '固原', '中卫'],
    'XJ': ['乌鲁木齐', '克拉玛依', '阿拉尔', '图木舒克', '五家渠', '北屯', '吐鲁番', '哈密', '和田地区', '阿克苏地区', '喀什地区', '塔城地区', '阿勒泰地区',
                 '克孜勒苏柯尔克孜自治州', '巴音郭楞蒙古自治州', '昌吉回族自治州', '博尔塔拉蒙古自治州', '伊犁哈萨克自治州', '石河子', '阿拉尔', '图木舒克', '五家渠'],
    'XZ': ['拉萨', '那曲', '昌都', '山南', '日喀则', '阿里', '林芝'],
    'BJ': ['北京'],
    'TJ': ['天津'],
    'SH': ['上海'],
    'CQ': ['重庆']
}

province_num= {'GD':0, 'ZJ':1,'JS':2,'SC':3}

def to_province(city):
    for k, v in province_include.items():
        if city in v:
            return k
    return city


def draw_city():
    info = pd.read_csv('data/user_all_info.csv', encoding='utf-8')
    info['city_num'] = info['city_num'].apply(to_province)
    info.to_csv('data/info1.csv')
    # plt.figure(figsize=(50, 50))
    # sns.set(style="darkgrid")
    # sns.countplot(x="city_num",data=info, palette="Set2")
    # sns.despine()
    # sns.countplot(x="city_num", hue="result", data=info, palette="Set2")
    # plt.legend(labels=["0", "1"])
    # plt.show()
    # print(info['result'].value_counts())
    # print(info['city_num'].value_counts())

    # plt.figure(figsize=(20, 50))
    # sns.set(style="darkgrid")
    # sns.despine()
    # sns.countplot(x="city_num", hue="login_time", data=info, palette="Set2")
    # plt.show()



if __name__ == '__main__':
    draw_city()

